Repository: AndrePaulino/pt.quarkus.io
Catalog: l10n/po/*/_guides/apicurio-registry-dev-services.adoc.po
Languages: es

source: Dev Services for Apicurio Registry
es: Servicios de desarrollo para Apicurio Registry

source: Enabling / Disabling Dev Services for Apicurio Registry
es: Activación/desactivación de los servicios de desarrollo para el registro de Apicurio

source: Dev Services for Apicurio Registry is automatically enabled unless:
es: Los Servicios de Desarrollo para el Registro de Apicurio se activan automáticamente a menos que:

source: `quarkus.apicurio-registry.devservices.enabled` is set to `false`
es: `quarkus.apicurio-registry.devservices.enabled` se ajusta a `false`

source: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` is configured
es: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` está configurado

source: Shared registry
es: Registro compartido

source: Most of the time you need to share the registry between applications. Dev Services for Apicurio Registry implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single registry.
es: La mayoría de las veces se necesita compartir el registro entre aplicaciones. Dev Services for Apicurio Registry implementa un mecanismo de _descubrimiento de servicios_ para que sus múltiples aplicaciones Quarkus que se ejecutan en modo _dev_ compartan un único registro.

source: Dev Services for Apicurio Registry starts the container with the `quarkus-dev-service-apicurio-registry` label which is used to identify the container.
es: Dev Services for Apicurio Registry inicia el contenedor con la etiqueta `quarkus-dev-service-apicurio-registry` que se utiliza para identificar el contenedor.

source: If you need multiple (shared) registries, you can configure the `quarkus.apicurio-registry.devservices.service-name` attribute and indicate the registry name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `apicurio-registry`.
es: Si necesitas varios registros (compartidos), puedes configurar el atributo `quarkus.apicurio-registry.devservices.service-name` e indicar el nombre del registro. Se busca un contenedor con el mismo valor, o se inicia uno nuevo si no se encuentra ninguno. El nombre de servicio por defecto es `apicurio-registry`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.apicurio-registry.devservices.shared=false`.
es: El uso compartido está activado por defecto en el modo de desarrollo, pero está desactivada en el modo de prueba. Puede desactivar el uso compartido con `quarkus.apicurio-registry.devservices.shared=false`.

source: Setting the port
es: Ajuste del puerto

source: By default, Dev Services for Apicurio Registry picks a random port and configures the application. You can set the port by configuring the `quarkus.apicurio-registry.devservices.port` property.
es: Por defecto, Dev Services for Apicurio Registry escoge un puerto al azar y configura la aplicación. Puede establecer el puerto configurando la propiedad `quarkus.apicurio-registry.devservices.port`.

source: Note that the Kafka channels in SmallRye Reactive messaging are automatically configured with the chosen port.
es: Tenga en cuenta que los canales Kafka en la mensajería reactiva de SmallRye se configuran automáticamente con el puerto elegido.

source: Configuring the image
es: Configuración de la imagen

source: Dev Services for Apicurio Registry uses `apicurio/apicurio-registry-mem` images. You can select any 2.x version from https://hub.docker.com/r/apicurio/apicurio-registry-mem:
es: Los servicios de desarrollo para el Registro de Apicurio utilizan imágenes de `apicurio/apicurio-registry-mem`. Puede seleccionar cualquier versión 2.x de https://hub.docker.com/r/apicurio/apicurio-registry-mem:
