Repository: AndrePaulino/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-built-*-authentication.adoc.po
Languages: es

source: Built-In Authentication Support
es: Soporte de autenticación incorporado

source: This document describes the Quarkus built-in authentication mechanisms for HTTP based FORM, BASIC and Mutual TLS authentication as well as the proactive authentication.
es: Este documento describe los mecanismos de autenticación incorporados en Quarkus para la autenticación FORM basada en HTTP, BASIC y Mutual TLS, así como la autenticación proactiva.

source: Basic Authentication
es: Autenticación básica

source: To enable basic authentication set `quarkus.http.auth.basic=true`. You must also have at least one extension installed that provides a username/password based `IdentityProvider`, such as xref:security-jdbc.adoc[Elytron JDBC].
es: Para habilitar la autenticación básica configure `quarkus.http.auth.basic=true`. También debe tener instalada al menos una extensión que proporcione un nombre de usuario/contraseña basado en `IdentityProvider`, como xref:security-jdbc.html[Elytron JDBC].

source: Please see xref:security.adoc#identity-providers[Security Identity Providers] for more information.
es: Para más información, consulte xref:security.html#identity-providers[Proveedores de Identidad de Seguridad].

source: Please also see xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties] section.
es: Consulte también la sección xref:security-testing.html#configuring-user-information[Configuración de la información del usuario en application.properties].

source: Form Based Authentication
es: Autenticación basada en formularios

source: The encryption key can be set using the `quarkus.http.auth.session.encryption-key` property, and it must be at least 16 characters long. This key is hashed using SHA-256 and the resulting digest is used as a key for AES-256 encryption of the cookie value. This cookie contains an expiry time as part of the encrypted value, so all nodes in the cluster must have their clocks synchronized. At one minute intervals a new cookie will be generated with an updated expiry time if the session is in use.
es: La clave de encriptación puede establecerse utilizando la propiedad `quarkus.http.auth.session.encryption-key`, y debe tener al menos 16 caracteres. Esta clave se convierte en hash utilizando SHA-256 y el resumen resultante se utiliza como clave para el cifrado AES-256 del valor de la cookie. Esta cookie contiene una hora de caducidad como parte del valor cifrado, por lo que todos los nodos del clúster deben tener sus relojes sincronizados. A intervalos de un minuto se generará una nueva cookie con una hora de caducidad actualizada si la sesión está en uso.

source: The following properties can be used to configure form based auth:
es: Las siguientes propiedades se pueden utilizar para configurar la autentificación basada en formularios:

source: Mutual TLS Authentication
es: Autenticación mutua TLS

source: Quarkus provides mTLS authentication so that you can authenticate users based on their X.509 certificates.
es: Quarkus proporciona autenticación mTLS para que pueda autenticar a los usuarios basándose en sus certificados X.509.

source: To use this authentication method, you should first enable SSL for your application. For more details, check the xref:http-reference.adoc#ssl[Supporting secure connections with SSL] guide.
es: Para utilizar este método de autenticación, primero debe habilitar SSL para su aplicación. Para más detalles, consulte la guía xref:http-reference.html#ssl[Soporte de conexiones seguras con SSL].

source: Once your application is accepting secure connections, the next step is to configure a `quarkus.http.ssl.certificate.trust-store-file` holding all the certificates that your application should trust as well as how your application should ask for certificates when a client (e.g.: browser or another service) tries to access one of its protected resources.
es: Una vez que su aplicación está aceptando conexiones seguras, el siguiente paso es configurar un `quarkus.http.ssl.certificate.trust-store-file` que contenga todos los certificados en los que su aplicación debe confiar, así como la forma en que su aplicación debe solicitar los certificados cuando un cliente (por ejemplo, un navegador u otro servicio) intente acceder a uno de sus recursos protegidos.

source: Configures a key store where the server's private key is located.
es: Configura un almacén de claves donde se encuentra la clave privada del servidor.

source: Configures a trust store from where the trusted certificates are going to be loaded from.
es: Configura un almacén de confianza desde el que se van a cargar los certificados de confianza.

source: Defines that the server should *always* ask certificates from clients. You can relax this behavior by using `REQUEST` so that the server should still accept requests without a certificate. Useful when you are also supporting authentication methods other than mTLS.
es: Define que el servidor debe pedir *siempre* certificados a los clientes. Puede relajar este comportamiento utilizando `REQUEST` para que el servidor siga aceptando peticiones sin certificado. Es útil cuando también se admiten métodos de autenticación distintos de mTLS.

source: Defines a policy where only authenticated users should have access to resources from your application.
es: Define una política en la que sólo los usuarios autentificados deben tener acceso a los recursos de su aplicación.

source: Once the incoming request matches a valid certificate in the truststore, your application should be able to obtain the subject by just injecting a `SecurityIdentity` as follows:
es: Una vez que la solicitud entrante coincida con un certificado válido en el almacén de confianza, su aplicación debería ser capaz de obtener el asunto con sólo inyectar un `SecurityIdentity` como sigue:

source: Obtaining the subject
es: Obtención del sujeto

source: You should also be able to get the certificate as follows:
es: También debería poder obtener el certificado de la siguiente manera:

source: Obtaining the certificate
es: Obtención del certificado

source: Authorization
es: Autorización

source: The information from the client certificate can be used to enhance Quarkus `SecurityIdentity`. For example, one can add new roles after checking a client certificate subject name, etc. Please see the xref:security-customization.adoc#security-identity-customization[SecurityIdentity Customization] section for more information about customizing Quarkus `SecurityIdentity`.
es: La información del certificado del cliente puede utilizarse para mejorar Quarkus `SecurityIdentity`. Por ejemplo, se pueden añadir nuevos roles después de comprobar el nombre del sujeto del certificado del cliente, etc. Consulte la sección xref:security-customization.html#security-identity-customization[Personalización de SecurityIdentity] para obtener más información sobre la personalización de Quarkus `SecurityIdentity`.

source: Proactive Authentication
es: Autenticación proactiva

source: This means that requests with an invalid credential will always be rejected, even for public pages. You can change this behavior and only authenticate when required by setting `quarkus.http.auth.proactive=false`.
es: Esto significa que las solicitudes con una credencial no válida siempre serán rechazadas, incluso para las páginas públicas. Puedes cambiar este comportamiento y autenticar sólo cuando se requiera configurando `quarkus.http.auth.proactive=false`.

source: If you disable proactive authentication then the authentication process will only be run when an identity is requested, either because there are security rules that requires the user to be authenticated, or due to programmatic access to the current identity.
es: Si desactiva la autenticación proactiva, el proceso de autenticación sólo se ejecutará cuando se solicite una identidad, ya sea porque hay reglas de seguridad que requieren que el usuario se autentique, o debido al acceso programático a la identidad actual.

source: How to customize authentication exception responses
es: Cómo personalizar las respuestas de excepción de autenticación

source: References
es: Referencias

source: xref:security.adoc[Quarkus Security]
es: xref:security.html[Seguridad Quarkus]
